#Requires AutoHotkey v2.0
; Ensure only one instance of the script runs
#SingleInstance Force 

Persistent(true)

; Активно всюди, де НЕ Slack
#HotIf !WinActive("ahk_exe slack.exe")

; =====================================
; ЕМОДЖІ
; =====================================

; Використовуємо зворотний апостроф (`), щоб екранувати двокрапку перед joy
:*?:`:joy::
{
	Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😂"
}

:*?:жощн::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😂"
}

:*?:жсміх::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😂"
}

:*?:`:rofl::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "🤣"
}

:*?:жкщад::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "🤣"
}

; --- Здивування / Wow ---
:*?:`:wow::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😲"
}

:*?:жцщц:: ; "wow" в укр. розкладці
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😲"
}

; --- Сумнів / Thinking ---
:*?:`:hm::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "🤔"
}
:*?:жрь:: ; "hm" в укр. розкладці 
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "🤔"
}
:*?:жгм::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "🤔"
}


; --- Сум / Sad ---
:*?:`:sad::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😢"
}
:*?:жсум::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😢"
}
:*?:жыфв:: ; "sad" в укр. розкладці
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "😢"
}

; --- Бонус: Окей ---
:*?:`:ok::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "👌"
}
:*?:жок::
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "👌"
}
:*?:жщн:: ; "ok" в укр. розкладці
{
    Sleep 50 ; для Viber щоб пережити вбудовану автозаміну
    SendText "👌"
}

; Активно всюди, де НЕ Slack - КІНЕЦЬ
#HotIf

; =====================================
; ІНШІ МОВИ ТА СИМВОЛИ
; =====================================

; Russian ы from ьi
:*?:ьі::ы
; Russian э from ьє
:*?:ьє::э
:*?:ьЄ::Э

; Turkish Special Characters Hotstring Script for AutoHotkey v2
:*?:^c::ç
:*?:^C::Ç
:*?:^s::ş
:*?:^S::Ş
:*?:^g::ğ
:*?:^G::Ğ
:*?:^o::ö
:*?:^O::Ö
:*?:^u::ü
:*?:^U::Ü
:*?C:^i::ı
:*?C:^I::İ

; Turkish Special Characters 2 - a faster way to type
:*?:;c::ç
:*?:;C::Ç
:*?:;s::ş
:*?:;S::Ş
:*?:;g::ğ
:*?:;G::Ğ
:*?:;o::ö
:*?:;O::Ö
:*?:;u::ü
:*?:;U::Ü
:*?C:;i::ı
:*?C:;I::İ
